In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame(
    {
        "city":["mumbai","delhi","banglore"],
        "temperature":[32,45,30],
        "humidity":[80,60,78]
    }
)
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
usa_weather = pd.DataFrame(
    {
        "city":["new york","chicago","orlando"],
        "temperature":[39,35,45],
        "humidity":[70,60,78]
    }
)
usa_weather

       city  temperature  humidity
0  new york           39        70
1   chicago           35        60
2   orlando           45        78

## concatanation of data frames

In [4]:
df = pd.concat([india_weather,usa_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           39        70
1   chicago           35        60
2   orlando           45        78

## have a look at the index above, to avoid that use ignore_index=True

In [5]:
df = pd.concat([india_weather,usa_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           39        70
4   chicago           35        60
5   orlando           45        78

## keys can be defined to differentiate the concatanated dfs, for that index will be different for both so don't write ingnore_index there

In [6]:
df = pd.concat([india_weather,usa_weather],keys=['india','usa'])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
usa   0  new york           39        70
      1   chicago           35        60
      2   orlando           45        78

## to locate one of the concatanated df

In [7]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [8]:
temp_df = pd.DataFrame({
    "city":["new york","chicago","orlando"],
        "temperature":[39,35,45]
})
temp_df

       city  temperature
0  new york           39
1   chicago           35
2   orlando           45

In [9]:
wind_df = pd.DataFrame({
    "city":["new york","chicago","orlando"],
        "windspeed":[39,35,45]
})
wind_df

       city  windspeed
0  new york         39
1   chicago         35
2   orlando         45

## now we want ot concate these two , let's see the regular approach

In [11]:
df1 = pd.concat([temp_df,wind_df])
df1

       city  temperature  windspeed
0  new york         39.0        NaN
1   chicago         35.0        NaN
2   orlando         45.0        NaN
0  new york          NaN       39.0
1   chicago          NaN       35.0
2   orlando          NaN       45.0

## you can see the NaN values , inspite of being for the same city, to solve this use axis

In [15]:
df1 = pd.concat([temp_df,wind_df],axis=1)
df1

       city  temperature      city  windspeed
0  new york           39  new york         39
1   chicago           35   chicago         35
2   orlando           45   orlando         45

## when data is not perfect , like missing values then it will put NaN there

In [17]:
temp_df = pd.DataFrame({
    "city":["new york","chicago"],
        "temperature":[39,35]
})
temp_df

       city  temperature
0  new york           39
1   chicago           35

In [18]:
wind_df

       city  windspeed
0  new york         39
1   chicago         35
2   orlando         45

In [19]:
df1 = pd.concat([temp_df,wind_df],axis=1)
df1

       city  temperature      city  windspeed
0  new york         39.0  new york         39
1   chicago         35.0   chicago         35
2       NaN          NaN   orlando         45